{
    "version": "v1.0.0",
    "entity": {
        "type": "organisation",
        "role": "maintainer",
        "name": "Unoplat Technologies PVT. LTD.",
        "email": "jayghiya@unoplat.co.in",
        "description": "Unoplat is a bootstrapped open-source organization based in India, driven by a dedicated team of five professionals. Our mission is to empower individual developers to build enterprise-grade backend systems single-handedly. By focusing on cutting-edge solutions in code context provisioning and cloud-native platforms, we aim to revolutionize backend development, making it more accessible, scalable, and efficient for developers worldwide.",
        "webpageUrl": {
            "url": "https://github.com/unoplat"
        }
    },
    "projects": [
        {
            "guid": "code-confluence",
            "name": "Unoplat CodeConfluence",
            "description": "Unoplat CodeConfluence is on a mission to become the definitive code context provider for any repository, seamlessly integrating across multiple domains. With deterministic, language-agnostic code parsing powered by CHAPI and ANTLR, it delivers precise insights that transcend traditional documentation. Engage effortlessly with your code through smart, context-aware interactions, empowering you to navigate and understand complex codebases with unmatched clarity and efficiency. In addition it will become the gen-ai interface for unoplat core in near future.",
            "webpageUrl": {
                "url": "https://unoplat.github.io/unoplat-code-confluence/"
            },
            "repositoryUrl": {
                "url": "https://github.com/unoplat/unoplat-code-confluence",
                 "wellknown": "https://github.com/unoplat/unoplat-code-confluence/blob/main/.well-known/funding-manifest-urls"
            },
            "licenses": ["spdx:AGPL-3.0"],
            "tags": ["code-context", "developer-tools", "integration", "open-source","graph-rag","dspy","gen-ai","llm"]
        },
        {
            "guid": "unoplat-core",
            "name": "Unoplat Core",
            "description": "Unoplat Core empowers individual developers to build enterprise-grade, cloud-native backends with ease. By integrating High Availability, Fault Tolerance, Observability, Infrastructure as Code, and seamless CI/CD pipelines, it enables one person to achieve what usually requires a full team. Accelerate development with Template Driven Application Development (TDAD), offering ready-to-deploy templates for streaming, batch processing, BPMN workflows, and microservices.",
            "webpageUrl": {
                "url": "https://github.com/unoplat/unoplat"
            },
            "repositoryUrl": {
                "url": "https://github.com/unoplat/unoplat"
            },
            "licenses": ["spdx:AGPL-3.0"],
            "tags": ["cloud-native", "kubernetes", "self-hosted", "infrastructure", "open-source","gen-ai","llm","devops","databases","templates","iac"]
        }
    ],
    "funding": {
        "channels": [
            {
                "guid": "unoplat-company-bank",
                "type": "bank",
                "address": "company account registration is in progress. Will be availabe soon.", 
                "description": "Donations can be made via direct bank transfer to our company account. Please contact us at jayghiya@unoplat.co.in for banking details."
            }
        ],
        "plans": [
            {
                "guid": "home-lab-fund",
                "status": "active",
                "name": "Home Lab Server Funding",
                "description": "One-time funding needed for our home lab server setup, including 6x NVIDIA RTX 4090 GPUs and AMD Threadripper Pro etc., to support our open-source projects and make our cutting edge cloud native and llm based experiments sustainable.",
                "amount": 2000000,
                "currency": "INR",
                "frequency": "one-time",
                "channels": ["company-bank"]
            },
            {
                "guid": "maintainer-support",
                "status": "active",
                "name": "Maintainer Support",
                "description": "Monthly support for 1 year our maintainers working on Unoplat projects.",
                "amount": 40000,
                "currency": "INR",
                "frequency": "monthly",
                "channels": ["company-bank"]
            },
            {
                "guid": "oss-bounties",
                "status": "active",
                "name": "Open Source Bounties for our github issues",
                "description": "Monthly funds for 1 year to support open-source bounties and rewards for contributors.",
                "amount": 40000,
                "currency": "INR",
                "frequency": "monthly",
                "channels": ["company-bank"]
            }
        ]
    }
}